{
  "data": "<div class='item item-body content-item'><h1>How and when to buy the iPhone 6S and iPhone 6S Plus<\/h1><span>September 12, 2015<\/span><p>Enlarge Image<\/p><div class='item item-image'><img src='http:\/\/cnet3.cbsistatic.com\/hub\/i\/r\/2015\/09\/10\/147c6e6a-2611-4d6f-97ce-86e881480bd5\/resize\/620x\/db94770b3dbd6a2b2d4bb3bb1b2634e9\/apple-event-sept9-2015-iphone6splus-3263.jpg'><\/div><p>During a keynote event in San Francisco this week, Apple unveiled the  \tiPhone 6S and the iPhone 6S Plus. Apart from a new rose gold color option, the new iPhones look the same as last year's models, though Apple has added stronger glass and aluminum to help prevent the phones from bending when sat on. On the inside, the new models get a new processor, better cameras and haptic feedback to allow for 3D Touch.<\/p><p>The iPhone 6S and the 6S Plus will be available for pre-order on September 12 and will be in stores on September 25. The new models will be available direct from Apple and carrier locations.<\/p><p>Pricing for the iPhone 6S and 6S Plus remains the same as last year's iPhone 6 and 6 Plus, though Apple has new  \tmonthly installment plans, and the carriers have a number of deals and promotions.<\/p><p>In the US, the iPhone 6S will start at $199 for the 16GB model; $299 for the 64GB model; $399 for the 128GB model with a two-year contract. Off-contract prices for the iPhone 6S jump to $649, $749 and $849, respectively.<\/p><p>The iPhone 6S Plus with a two-year contract will cost $299 for the 16GB model; $399 for the 64GB; $499 for 128GB. Off-contract prices for the iPhone 6S Plus jump to $749 (16GB), $849 (64GB) and $949 (128GB).<\/p><h3>Apple<\/h3><p>You can line up on Friday, September 25 at an Apple Store to buy a new iPhone, but you can skip the line and pre-order on Apple's website starting at 12:01am PDT on Saturday, September 12.<\/p><p>If Apple's website gets overwhelmed with eager iPhone shoppers, try using the Apple Store app on your current iPhone or iPad. In previous years the app has been more reliable than Apple's website on pre-order day, and Apple says it's the best way to buy.<\/p><p>As with past iPhone pre-order arrangements, you can preorder and pay for the device online and schedule a pickup in the store. And as with past pre-orders, if supplies run out, you may miss the window for picking up your new iPhone on launch day and will get bumped to the next availability date.<\/p><p>In addition to the standard on-contract and full retail pricing options, Apple has introduced a new pricing plan it calls the iPhone Upgrade Program. Available for now only in the US, the plan costs $32.41 a month for the 16GB iPhone 6S, $36.58 a month for the 64GB iPhone 6S and $40.75 a month for the 128GB iPhone 6S.<\/p><p>Pricing for the iPhone 6S Plus is $36.58, $40.75 and $44.91 a month for the 16GB, 64GB and 128GB models, respectively. You'll need to sign on for two years, but you'll have the option to trade in your iPhone for a new model each year. And Apple throws in AppleCare coverage to sweeten the deal.<\/p><p>In order to take part in the new iPhone Upgrade Program, you will need to visit an Apple Store in person. You can, however, make a reservation when preorders start on September 12.<\/p><h3>AT&T<\/h3><p>With AT&T Next plans, you pay the full retail price of the phone over a certain period: 20 months, 24 months or 30 months. You can upgrade after 12 months with the 20-month plan, after 18 months with the 24-month plan, and after 24 months with the 30-month plan. The 20-month Next 12 plan costs $32.50 a month for the 16GB iPhone 6S, for example, or only $21.67 a month for the same phone with the 30-month Next 24 plan.<\/p><h3>Sprint<\/h3><p>By way of its iPhone Forever plan, Sprint is offering the 16GB iPhone 6S for $22 a month and will let you upgrade with the next iPhone is released. And if you trade in your current smartphone by the end of the year, the monthly rate drops to $15 a month. The same deal applies to the 16GB iPhone 6S Plus; pay $26 a month or only $19 a month with a trade-in.<\/p><h3>T-Mobile<\/h3><p>T-Mobile will offer the 16GB iPhone 6S for $20 a month and the 16GB iPhone 6S Plus for $24 a month for 18 months with Jump On Demand upgrade program. Then at the end of 18 months, you will pay $164 to keep the iPhone 6S, which means you'll end up paying $524 for the phone or $125 less than Apple's off-contract $649 retail price for the phone. Check out T-Mobile CEO John Legere's rambling  \tblog post and video for more.<\/p><p>The Jump On Demand deal appears to be a good one, though there is no information yet on pricing for the 64GB and 128GB models or if they'll receive similar discounts.<\/p><p>If you don't want to go the lease-to-own route with a Jump On Demand plan, you can opt for one of T-Mobile's Simple Choice plans. You'll pay $27.08 a month for any capacity iPhone 6S and $31.25 a month for any capacity iPhone 6S Plus; the only difference is the down payment. You'll pay $0 down for either 16GB model, $99.99 down for either 64GB model, and $199.99 for either 128GB model.<\/p><h3>Verizon<\/h3><p>Verizon has done away with subsidized pricing and two-year plans, except for existing customers. New customers will either need to pay full retail price for a phone or choose a monthly plan. Verizon's monthly plans start at $27.08 for the iPhone 6S and $31.24 for iPhone 6S Plus. Do the math and you'll find that you'll end up paying the full retail price for an iPhone 6S or 6S Plus over the 24 months of the plan.<\/p><h3>International pricing<\/h3><p>In the UK, the iPhone 6S costs £539 (16GB), £619 (64GB) and £699 (128GB). In contrast, the 6S Plus will go for £619, £699 and £789, respectively.<\/p><p>In Australia, the iPhone 6S costs AU$1,079 (16GB), AU$1,229 (64GB) and AU$1,379 (128GB). The 6S Plus will go for AU$1,229, AU$1,379 and AU$1,529, respectively.<\/p><\/div>",
  "created_at": "September 12, 2015"
}